{"class_name": "Tokenizer", "config": {"num_words": 5000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 19000, "word_counts": "{\"include\": 46, \"headers\": 9, \"deque\": 317, \"h\": 128, \"system\": 163, \"utils\": 3, \"unit\": 64, \"test\": 122, \"cutest\": 6, \"this\": 547, \"function\": 277, \"will\": 142, \"initialize\": 8, \"a\": 675, \"new\": 309, \"then\": 37, \"it\": 132, \"return\": 645, \"it's\": 9, \"pointer\": 173, \"param\": 102, \"freefun\": 10, \"the\": 964, \"items\": 64, \"free\": 48, \"address\": 36, \"that\": 36, \"be\": 54, \"called\": 6, \"to\": 305, \"initialized\": 2, \"dequeinitialization\": 1, \"void\": 227, \"if\": 647, \"null\": 373, \"ifdef\": 75, \"c\": 144, \"datastructures\": 77, \"errorsteststruct\": 75, \"error\": 74, \"errorcode\": 71, \"invalid\": 65, \"arg\": 60, \"else\": 226, \"fprintf\": 71, \"stderr\": 71, \"message\": 101, \"data\": 300, \"structure\": 124, \"exit\": 71, \"endif\": 80, \"malloc\": 8, \"sizeof\": 19, \"failed\": 27, \"allocation\": 22, \"length\": 155, \"10\": 206, \"arr\": 141, \"array\": 355, \"front\": 26, \"rear\": 15, \"0\": 869, \"take\": 21, \"item\": 79, \"insert\": 51, \"in\": 231, \"of\": 301, \"dequeinsertfront\": 1, \"2\": 510, \"temparr\": 8, \"memcpy\": 3, \"copy\": 16, \"for\": 348, \"int\": 783, \"i\": 1018, \"1\": 1062, \"end\": 77, \"dequeinsertrear\": 1, \"remove\": 40, \"from\": 82, \"dequegetfront\": 1, \"dequeisempty\": 5, \"empty\": 79, \"dequegetrear\": 1, \"without\": 13, \"removing\": 5, \"dequepeekfront\": 1, \"dequepeekrear\": 1, \"double\": 11, \"consisting\": 1, \"dequetoarray\": 1, \"dequegetlength\": 2, \"number\": 133, \"one\": 67, \"is\": 241, \"other\": 16, \"wise\": 12, \"zero\": 12, \"clear\": 12, \"and\": 151, \"destroying\": 1, \"cleardeque\": 2, \"destroy\": 3, \"destroydeque\": 1, \"dlinkedlistdeque\": 1, \"linkedlists\": 1, \"doublylinkedlist\": 15, \"doubly\": 25, \"linked\": 52, \"list\": 208, \"memory\": 2, \"freeing\": 6, \"allocated\": 1, \"dldeque\": 19, \"dldequeinitialization\": 1, \"linkedlist\": 41, \"doublylinkedlistinitialization\": 1, \"passed\": 12, \"dldequeinsertfront\": 1, \"doublylinkedlistaddfirst\": 1, \"dldequeinsertrear\": 1, \"doublylinkedlistaddlast\": 1, \"dldequegetfront\": 1, \"dldequeisempty\": 5, \"doublylinkedlistdeletefirstwtofr\": 1, \"last\": 14, \"dldequegetrear\": 1, \"doublylinkedlistdeletelastwtofr\": 1, \"first\": 44, \"dldequepeekfront\": 1, \"doublylinkedlistgetfirst\": 1, \"dldequepeekrear\": 1, \"doublylinkedlistgetlast\": 1, \"consist\": 1, \"an\": 68, \"contains\": 23, \"all\": 34, \"dldequetoarray\": 1, \"doublylinkedlisttoarray\": 1, \"dldequegetlength\": 1, \"doublylinkedlistgetlength\": 1, \"check\": 33, \"or\": 37, \"not\": 66, \"was\": 17, \"doublylinkedlistisempty\": 1, \"cleardldeque\": 1, \"doublylinkedlistclear\": 1, \"with\": 43, \"destroydldeque\": 1, \"destroydoublylinkedlist\": 1, \"directedgraph\": 23, \"lists\": 2, \"arraylist\": 30, \"tables\": 2, \"hashmap\": 1, \"hashset\": 3, \"stacks\": 1, \"stack\": 93, \"queues\": 3, \"queue\": 76, \"defined\": 2, \"borlandc\": 1, \"typedef\": 6, \"unsigned\": 3, \"char\": 16, \"uint8\": 2, \"t\": 64, \"int64\": 4, \"long\": 22, \"uintptr\": 8, \"elif\": 10, \"msc\": 1, \"ver\": 1, \"stdint\": 1, \"struct\": 5, \"dirgraphnode\": 34, \"brief\": 1, \"implements\": 3, \"basic\": 2, \"directed\": 44, \"graph\": 204, \"node\": 402, \"var\": 201, \"value\": 256, \"member\": 35, \"'value'\": 1, \"adjacentnodes\": 18, \"'adjacentnodes'\": 1, \"adjacent\": 11, \"nodes\": 51, \"valuecompfun\": 4, \"'valuecompfun'\": 1, \"comparator\": 2, \"compare\": 4, \"values\": 47, \"const\": 13, \"dirgraphtopologicalsortr\": 1, \"visitednodes\": 2, \"sortstack\": 1, \"dirgraphnodeispartofcycler\": 1, \"useful\": 3, \"freedgraphnode\": 3, \"nodetofree\": 6, \"arraylistgetlength\": 2, \"arraylistremovewtfr\": 1, \"destroyarraylist\": 1, \"comparing\": 3, \"two\": 40, \"n1\": 9, \"n2\": 10, \"second\": 10, \"are\": 30, \"equal\": 11, \"dgraphnodecomp\": 2, \"node1\": 3, \"node2\": 2, \"note\": 9, \"because\": 4, \"implemented\": 4, \"by\": 26, \"hash\": 31, \"map\": 7, \"you\": 29, \"need\": 5, \"pass\": 15, \"hashing\": 3, \"freevalue\": 7, \"valuecomp\": 7, \"hashfun\": 4, \"unique\": 1, \"integer\": 29, \"representing\": 3, \"key\": 187, \"directedgraphinitialization\": 1, \"hashmapinitialization\": 1, \"already\": 2, \"immediately\": 1, \"dirgraphaddnode\": 1, \"hashmapcontains\": 2, \"newnode\": 30, \"arraylistinitialization\": 1, \"5\": 255, \"hashmapinsert\": 1, \"as\": 102, \"parameter\": 5, \"found\": 29, \"dirgraphremovenode\": 1, \"nodetodelete\": 6, \"hashmapget\": 8, \"hashmapnodes\": 8, \"hashmaptoarray\": 3, \"hashmapgetlength\": 5, \"index\": 151, \"arraylistgetindex\": 3, \"arraylistremoveatindexwtfr\": 3, \"hashmapdelete\": 1, \"deleted\": 2, \"dirgraphremovenodewtofr\": 1, \"hashmapdeletewtofrall\": 1, \"create\": 12, \"edge\": 62, \"between\": 6, \"them\": 5, \"they\": 1, \"fromval\": 12, \"toval\": 12, \"dirgraphaddedge\": 1, \"fromnode\": 11, \"tonode\": 10, \"arraylistcontains\": 2, \"arraylistadd\": 1, \"dirgraphremoveedge\": 1, \"tonodeindex\": 3, \"dirgraphcontainsnode\": 1, \"there\": 20, \"dirgraphcontainsedge\": 1, \"dirgraphgetsize\": 1, \"dirgraphisempty\": 1, \"itself\": 6, \"cleardirgraph\": 1, \"clearhashmap\": 1, \"destroydirgraph\": 1, \"destroyhashmap\": 1, \"print\": 81, \"name\": 30, \"connected\": 4, \"names\": 2, \"printval\": 5, \"printing\": 4, \"dirgraphprint\": 1, \"printf\": 8, \"nis\": 1, \"n\": 491, \"j\": 339, \"arraylistget\": 1, \"tpointer\": 5, \"traversal\": 5, \"functions\": 2, \"freeuintptr\": 1, \"parameters\": 1, \"title\": 88, \"permutation\": 9, \"string\": 197, \"what\": 4, \"do\": 7, \"generate\": 2, \"time\": 21, \"complexity\": 7, \"o\": 78, \"code\": 17, \"written\": 2, \"tested\": 2, \"https\": 26, \"github\": 25, \"com\": 47, \"rafu01\": 1, \"date\": 6, \"oct\": 1, \"2020\": 14, \"iostream\": 5, \"algorithm\": 21, \"using\": 134, \"namespace\": 43, \"std\": 26, \"1st\": 3, \"approach\": 7, \"idea\": 1, \"keep\": 4, \"part\": 3, \"fixed\": 10, \"swap\": 24, \"parts\": 1, \"s\": 58, \"left\": 78, \"right\": 78, \"base\": 21, \"case\": 10, \"cout\": 57, \"endl\": 27, \"swapping\": 1, \"permuation\": 1, \"2nd\": 1, \"permutationwithstl\": 2, \"we\": 104, \"sort\": 37, \"so\": 13, \"converted\": 1, \"lexicographically\": 1, \"smallest\": 7, \"ascennding\": 1, \"order\": 11, \"begin\": 3, \"next\": 278, \"while\": 118, \"exists\": 14, \"main\": 80, \"str\": 40, \"abc\": 7, \"size\": 113, \"recursive\": 12, \"tree\": 29, \"language\": 1, \"knights\": 1, \"tour\": 4, \"backtracking\": 4, \"problem\": 14, \"statement\": 4, \"knight\": 3, \"placed\": 4, \"on\": 19, \"block\": 21, \"board\": 8, \"moving\": 2, \"according\": 1, \"rules\": 1, \"chess\": 2, \"must\": 5, \"visit\": 1, \"each\": 24, \"square\": 9, \"exactly\": 1, \"once\": 4, \"define\": 8, \"at\": 58, \"line\": 9, \"17\": 27, \"here\": 15, \"8\": 100, \"arrays\": 13, \"move\": 5, \"wrt\": 1, \"its\": 13, \"current\": 199, \"position\": 256, \"imove\": 2, \"jmove\": 2, \"tell\": 1, \"cell\": 4, \"go\": 6, \"safe\": 1, \"bool\": 21, \"issafe\": 4, \"x\": 148, \"y\": 71, \"sol\": 14, \"true\": 64, \"false\": 51, \"printsolution\": 2, \"solvektutil\": 3, \"movei\": 4, \"k\": 92, \"try\": 3, \"moves\": 4, \"coordinate\": 1, \"solvekt\": 2, \"represent\": 2, \"initialising\": 1, \"start\": 80, \"solution\": 8, \"does\": 3, \"exist\": 5, \"find\": 18, \"subset\": 8, \"whose\": 3, \"sum\": 35, \"specified\": 2, \"worst\": 1, \"space\": 12, \"complecity\": 1, \"bits\": 26, \"stdc\": 20, \"subsetsum\": 3, \"set\": 126, \"pos\": 37, \"tmpsum\": 6, \"along\": 3, \"breadth\": 4, \"consider\": 7, \"level\": 10, \"depth\": 6, \"enter\": 28, \"elements\": 24, \"cin\": 33, \"given\": 29, \"no\": 61, \"required\": 7, \"books\": 3, \"among\": 1, \"students\": 3, \"possible\": 11, \"ispossible\": 2, \"vector\": 15, \"pages\": 11, \"cnt\": 10, \"sumallocated\": 5, \"b\": 84, \"low\": 77, \"high\": 71, \"minimum\": 29, \"min\": 65, \"binary\": 8, \"search\": 39, \"mid\": 81, \"12\": 111, \"34\": 18, \"67\": 8, \"90\": 16, \"kthelement\": 3, \"arr1\": 4, \"arr2\": 4, \"m\": 61, \"max\": 72, \"cut1\": 8, \"cut2\": 5, \"l1\": 4, \"l2\": 3, \"r1\": 2, \"r2\": 3, \"array1\": 11, \"3\": 337, \"6\": 186, \"7\": 105, \"9\": 90, \"array2\": 4, \"4\": 258, \"element\": 66, \"kth\": 1, \"final\": 30, \"sorted\": 19, \"float\": 9, \"median\": 3, \"nums1\": 8, \"nums2\": 8, \"finalarray\": 8, \"15\": 45, \"setprecision\": 1, \"multiply\": 3, \"ans\": 43, \"getnthroot\": 2, \"eps\": 2, \"1e\": 1, \"th\": 9, \"root\": 18, \"27\": 19, \"bleak\": 5, \"whether\": 2, \"cannot\": 4, \"represented\": 2, \"positive\": 2, \"'x'\": 2, \"bit\": 8, \"count\": 122, \"e\": 62, \"countsetbits\": 4, \"any\": 8, \"non\": 37, \"negative\": 3, \"yes\": 4, \"nibbles\": 4, \"byte\": 2, \"example\": 9, \"100\": 67, \"01100100\": 1, \"0110\": 1, \"0100\": 1, \"get\": 61, \"01000110\": 1, \"which\": 12, \"70\": 13, \"decimal\": 18, \"swapnibbles\": 3, \"result\": 29, \"0x0f\": 1, \"0xf0\": 1, \"ll\": 20, \"getting\": 5, \"pth\": 4, \"getbit\": 2, \"p\": 185, \"mask\": 8, \"setting\": 2, \"setbit\": 2, \"clr\": 1, \"clrbit\": 3, \"upbit\": 2, \"val\": 31, \"11111111111\": 1, \"clrlbit\": 2, \"range\": 16, \"fp\": 3, \"lp\": 3, \"clrbitrange\": 2, \"setno\": 2, \"counter\": 16, \"setbitcountfast\": 2, \"ios\": 4, \"sync\": 4, \"stdio\": 5, \"tie\": 9, \"14\": 41, \"63\": 8, \"builtin\": 1, \"popcount\": 1, \"dtobint\": 2, \"lsbit\": 2, \"dtob\": 2, \"append\": 29, \"reverse\": 17, \"replace\": 8, \"maskclr\": 2, \"maskshf\": 2, \"generator\": 2, \"lsb\": 2, \"ignore\": 2, \"l\": 43, \"subsets\": 1, \"3\\u00e3\\u00973\": 1, \"tiles\": 10, \"every\": 6, \"tile\": 27, \"has\": 17, \"objective\": 1, \"place\": 8, \"numbers\": 23, \"match\": 1, \"configuration\": 4, \"can\": 40, \"slide\": 1, \"four\": 3, \"above\": 4, \"below\": 4, \"into\": 5, \"program\": 143, \"path\": 13, \"destination\": 6, \"puzzle\": 3, \"branch\": 2, \"bound\": 2, \"assumes\": 1, \"instance\": 4, \"solvable\": 2, \"state\": 18, \"stores\": 12, \"parent\": 14, \"helps\": 1, \"tracing\": 1, \"when\": 9, \"answer\": 2, \"matrix\": 4, \"mat\": 17, \"blank\": 6, \"coordinates\": 3, \"misplaced\": 3, \"cost\": 16, \"far\": 2, \"printmatrix\": 2, \"d\": 26, \"allocate\": 1, \"newx\": 3, \"newy\": 3, \"update\": 11, \"cordinates\": 1, \"bottom\": 29, \"top\": 39, \"row\": 33, \"col\": 78, \"calculate\": 13, \"ie\": 7, \"their\": 1, \"goal\": 1, \"calculatecost\": 3, \"initial\": 15, \"valid\": 12, \"cordinate\": 1, \"printpath\": 3, \"comparison\": 1, \"object\": 23, \"used\": 9, \"heap\": 37, \"comp\": 2, \"operator\": 8, \"lhs\": 3, \"rhs\": 3, \"solve\": 12, \"priority\": 19, \"store\": 15, \"live\": 7, \"pq\": 6, \"add\": 80, \"push\": 48, \"finds\": 2, \"least\": 9, \"childrens\": 1, \"finally\": 2, \"deletes\": 1, \"estimated\": 1, \"pop\": 38, \"child\": 20, \"children\": 5, \"driver\": 5, \"tiling\": 1, \"divide\": 3, \"conquer\": 2, \"description\": 6, \"where\": 12, \"form\": 31, \"missing\": 10, \"expected\": 2, \"fill\": 4, \"shaped\": 3, \"2x2\": 2, \"1\\u00e3\\u00971\": 1, \"grid\": 9, \"256\": 3, \"placing\": 1, \"x1\": 2, \"y1\": 2, \"x2\": 2, \"y2\": 2, \"x3\": 2, \"y3\": 2, \"method\": 11, \"pos1\": 6, \"pos2\": 6, \"filled\": 1, \"single\": 6, \"identifying\": 1, \"location\": 5, \"center\": 10, \"such\": 3, \"cover\": 1, \"subsquare\": 1, \"now\": 21, \"subsquares\": 1, \"have\": 18, \"quadrant\": 4, \"2st\": 1, \"3st\": 1, \"4st\": 1, \"recursively\": 3, \"subdividing\": 1, \"problems\": 1, \"subquarters\": 1, \"recurrence\": 1, \"relation\": 1, \"constant\": 1, \"4t\": 1, \"sample\": 10, \"input\": 63, \"output\": 18, \"having\": 2, \"same\": 7, \"help\": 2, \"identify\": 1, \"spot\": 1, \"hence\": 1, \"declared\": 1, \"reference\": 1, \"kadane's\": 1, \"finding\": 5, \"subarray\": 4, \"allowed\": 7, \"knapsack\": 7, \"weights\": 3, \"put\": 19, \"these\": 3, \"capacity\": 33, \"w\": 30, \"maximum\": 12, \"total\": 35, \"remember\": 2, \"only\": 5, \"atmost\": 1, \"format\": 7, \"weight\": 54, \"hold\": 1, \"integers\": 6, \"w1\": 1, \"w2\": 1, \"wn\": 1, \"wi\": 3, \"third\": 1, \"v1\": 27, \"v2\": 21, \"vn\": 1, \"vi\": 7, \"stored\": 2, \"constraints\": 1, \"like\": 5, \"either\": 6, \"whole\": 1, \"can't\": 4, \"since\": 6, \"just\": 9, \"options\": 3, \"call\": 2, \"wt\": 15, \"dp\": 156, \"wtsofar\": 13, \"30\": 52, \"50\": 72, \"60\": 22, \"explanation\": 2, \"clearly\": 1, \"see\": 5, \"choices\": 2, \"don't\": 5, \"use\": 11, \"bruteforce\": 1, \"exponential\": 1, \"our\": 18, \"within\": 1, \"bounds\": 2, \"also\": 2, \"runtime\": 6, \"quite\": 2, \"optimal\": 13, \"states\": 2, \"'index'\": 1, \"'wtsofar'\": 1, \"amount\": 6, \"let's\": 2, \"say\": 4, \"doing\": 1, \"becz\": 1, \"based\": 4, \"indexing\": 1, \"assign\": 1, \"simply\": 2, \"case1\": 1, \"case2\": 1, \"dynamic\": 5, \"programming\": 5, \"longest\": 9, \"common\": 5, \"subsequence\": 11, \"lcs\": 12, \"initializing\": 1, \"dimensional\": 1, \"table\": 9, \"implement\": 5, \"three\": 2, \"sequences\": 1, \"z\": 31, \"n3\": 6, \"increasing\": 5, \"strictly\": 1, \"algo\": 1, \"modified\": 3, \"stor\": 1, \"uses\": 4, \"lis\": 16, \"up\": 19, \"ending\": 3, \"till\": 6, \"incusive\": 1, \"formed\": 2, \"bhy\": 1, \"own\": 3, \"elemnts\": 1, \"smaller\": 4, \"than\": 13, \"present\": 3, \"side\": 3, \"inclusion\": 1, \"inclusive\": 2, \"compute\": 2, \"optimized\": 2, \"manner\": 2, \"taking\": 5, \"command\": 3, \"inputs\": 4, \"members\": 1, \"directly\": 1, \"want\": 13, \"run\": 5, \"comment\": 1, \"56\": 10, \"uncomment\": 1, \"65\": 4, \"66\": 8, \"22\": 22, \"33\": 23, \"21\": 19, \"41\": 3, \"80\": 10, \"palindromic\": 4, \"returns\": 10, \"lps\": 3, \"cl\": 7, \"results\": 5, \"subproblems\": 1, \"strings\": 7, \"palindrome\": 8, \"iterate\": 5, \"through\": 18, \"substrings\": 1, \"ith\": 11, \"column\": 1, \"preceeding\": 2, \"atleast\": 1, \"difference\": 1, \"maxval\": 4, \"checking\": 4, \"indices\": 2, \"differences\": 1, \"fmaxs\": 4, \"returning\": 3, \"maxm\": 1, \"columns\": 1, \"2d\": 2, \"v\": 67, \"temp\": 70, \"func\": 2, \"staring\": 1, \"after\": 6, \"traces\": 1, \"partitioning\": 6, \"substring\": 2, \"partition\": 11, \"\\u00e2\\u0080\\u009caba\": 1, \"bbabb\": 1, \"aba\\u00e2\\u0080\\u009d\": 1, \"\\u00e2\\u0080\\u009cababbbabbababa\\u00e2\\u0080\\u009d\": 2, \"determine\": 2, \"fewest\": 1, \"cuts\": 4, \"needed\": 5, \"\\u00e2\\u0080\\u009ca\": 1, \"babbbab\": 1, \"ababa\\u00e2\\u0080\\u009d\": 1, \"limits\": 1, \"static\": 85, \"args\": 28, \"arraysdemo\": 3, \"testonebasedarray\": 3, \"algorithms\": 12, \"csharp\": 2, \"course\": 2, \"listdemo\": 2, \"arraytimecomplexity\": 1, \"access\": 3, \"console\": 52, \"writeline\": 16, \"searchedelement\": 2, \"searching\": 12, \"takes\": 1, \"full\": 1, \"bigarray\": 3, \"there's\": 1, \"some\": 7, \"assigning\": 1, \"private\": 50, \"removeat\": 1, \"hidden\": 19, \"loop\": 13, \"inside\": 1, \"newarray\": 3, \"a1\": 2, \"a2\": 1, \"a3\": 3, \"a4\": 2, \"foreach\": 23, \"el\": 27, \"myarray\": 11, \"myarray2\": 2, \"createinstance\": 2, \"typeof\": 2, \"setvalue\": 5, \"read\": 8, \"notimplementedexception\": 1, \"2019\": 4, \"2021\": 1, \"2022\": 3, \"starting\": 8, \"getlowerbound\": 2, \"getupperbound\": 2, \"getvalue\": 1, \"csharpalgorithms\": 19, \"public\": 294, \"class\": 435, \"bubblesort\": 6, \"partindex\": 14, \"utility\": 6, \"selectionsort\": 5, \"largestat\": 4, \"insertionsort\": 5, \"curunsorted\": 3, \"shellsort\": 3, \"gap\": 15, \"allows\": 1, \"local\": 7, \"mergesort\": 12, \"aux\": 8, \"sub\": 9, \"bigger\": 1, \"merge\": 7, \"quicksort\": 10, \"pivot\": 7, \"break\": 10, \"collections\": 14, \"generic\": 14, \"linq\": 11, \"text\": 90, \"threading\": 11, \"tasks\": 11, \"symboltables\": 2, \"chainhashset\": 3, \"tkey\": 24, \"tvalue\": 16, \"sequentialsearchst\": 6, \"chains\": 16, \"defaultcapacity\": 1, \"gethashcode\": 5, \"0x7fffffff\": 1, \"throw\": 36, \"argumentnullexception\": 7, \"paramname\": 6, \"tryget\": 4, \"out\": 92, \"argumentexception\": 1, \"resize\": 2, \"keys\": 41, \"todo\": 1, \"previous\": 34, \"lecture\": 1, \"ienumerable\": 2, \"enqueue\": 16, \"doublelinkedlist\": 1, \"doublylinkednode\": 11, \"head\": 242, \"tail\": 114, \"isempty\": 31, \"addfirst\": 20, \"addlast\": 11, \"removefirst\": 8, \"invalidoperationexception\": 6, \"shift\": 21, \"removelast\": 7, \"former\": 2, \"penultimate\": 2, \"save\": 2, \"off\": 6, \"point\": 2, \"rest\": 2, \"behind\": 1, \"internal\": 12, \"person\": 1, \"age\": 1, \"ssn\": 1, \"phonenumber\": 7, \"areacode\": 8, \"exchange\": 8, \"override\": 3, \"equals\": 17, \"obj\": 7, \"referenceequals\": 5, \"unchecked\": 1, \"hashingbase\": 2, \"2166136261\": 1, \"hashingmultiplier\": 4, \"16777619\": 1, \"readkey\": 1, \"printoutlinkedlist\": 1, \"link\": 30, \"assumed\": 1, \"recursivebinarysearch\": 1, \"internalrecursivebinarysearch\": 4, \"binarysearch\": 18, \"st\": 1, \"stands\": 1, \"readonly\": 1, \"equalitycomparer\": 3, \"comparer\": 10, \"default\": 9, \"yield\": 2, \"should\": 7, \"adjusted\": 1, \"properly\": 1, \"pair\": 1, \"entirely\": 1, \"requested\": 1, \"otherwise\": 17, \"prev\": 165, \"singlylinkedlist\": 18, \"tmp\": 2, \"shifting\": 1, \"swaps\": 1, \"indexof\": 4, \"reflection\": 1, \"compilerservices\": 1, \"interopservices\": 1, \"general\": 2, \"information\": 4, \"about\": 22, \"assembly\": 18, \"controlled\": 1, \"following\": 3, \"attributes\": 1, \"change\": 7, \"attribute\": 2, \"modify\": 2, \"associated\": 10, \"assemblytitle\": 1, \"assemblydescription\": 1, \"assemblyconfiguration\": 1, \"assemblycompany\": 1, \"assemblyproduct\": 1, \"assemblycopyright\": 1, \"copyright\": 5, \"\\u00a9\": 1, \"assemblytrademark\": 1, \"assemblyculture\": 1, \"comvisible\": 3, \"makes\": 4, \"types\": 1, \"visible\": 1, \"components\": 1, \"type\": 23, \"guid\": 2, \"id\": 19, \"typelib\": 1, \"project\": 8, \"exposed\": 1, \"8594cb8e\": 1, \"2a90\": 1, \"48a1\": 1, \"a471\": 1, \"d2ce7b72db0a\": 1, \"version\": 3, \"consists\": 1, \"major\": 2, \"minor\": 1, \"build\": 3, \"revision\": 2, \"specify\": 1, \"'\": 41, \"shown\": 1, \"assemblyversion\": 2, \"assemblyfileversion\": 1, \"nunit\": 4, \"framework\": 4, \"testfixture\": 3, \"binarysearchtests\": 1, \"sortedinput\": 2, \"returnscorrectindex\": 1, \"assert\": 82, \"areequal\": 14, \"singlylinkedlisttests\": 1, \"setup\": 1, \"init\": 19, \"createemptylist\": 1, \"correctstate\": 4, \"istrue\": 14, \"isnull\": 2, \"oneitem\": 1, \"checkstatewithsinglenode\": 5, \"addremovetogettostatewithsinglenode\": 1, \"additemsincorrectorder\": 1, \"emptylist\": 2, \"throwsexception\": 2, \"throws\": 12, \"isfalse\": 1, \"aresame\": 1, \"sortingtests\": 1, \"samples\": 13, \"runttestsforsortalgorithm\": 7, \"action\": 6, \"collectionassert\": 1, \"isordered\": 1, \"printout\": 2, \"testcontext\": 3, \"trace\": 4, \"write\": 2, \"validinput\": 6, \"sortedoutput\": 5, \"customer\": 11, \"datetime\": 4, \"birthdata\": 5, \"logcountandcapacity\": 6, \"16\": 36, \"trimexcess\": 1, \"apimember\": 1, \"indexbinsearch\": 1, \"readonlycollection\": 1, \"readonlylist\": 1, \"asreadonly\": 1, \"toarray\": 3, \"listcustomers\": 2, \"birthdate\": 3, \"1988\": 3, \"elias\": 1, \"1995\": 1, \"11\": 62, \"maria\": 6, \"1992\": 5, \"25\": 27, \"ann\": 1, \"hello\": 12, \"veryveryveryloooooooooooooooooong\": 10, \"2c3\": 10, \"9024g\": 10, \"u\": 12, \"9weg\": 10, \"ouimwt\": 10, \"3q2tgwadh\": 10, \"rv\": 10, \"1v\": 20, \"vt23\": 10, \"vt\": 10, \"bum\": 22, \"bam\": 20, \"123\": 14, \"1234\": 12, \"12345\": 10, \"123456\": 10, \"words\": 108, \"trie\": 99, \"containsword\": 18, \"fail\": 47, \"testmethod\": 11, \"checkifsortedafteradding\": 1, \"triemap\": 7, \"previousword\": 9, \"word\": 35, \"compareordinal\": 3, \"diagnostics\": 3, \"checkifsortedafteraddingandremovingsomewords\": 1, \"removedwords\": 6, \"checkifprefixiscontained\": 1, \"containsprefix\": 1, \"getwordsbyprefixandcheckifsorted\": 1, \"prefix\": 39, \"afa\": 1, \"abaa\": 2, \"asd\": 1, \"ase\": 1, \"rfda\": 1, \"rtfs\": 1, \"efad\": 1, \"fasrg\": 1, \"t3st\": 2, \"test123\": 1, \"aheyj\": 1, \"gwecgs\": 1, \"gml\": 1, \"rbkp\": 1, \"r\": 30, \"wopger'lb\": 1, \"zzz\": 1, \"prefixwords\": 3, \"getwordsbyprefix\": 1, \"addingelementswithindexer\": 1, \"updatingelementswithindexerusingtrygetvaluemethodtogetvalue\": 1, \"trygetvalue\": 2, \"updated\": 8, \"kvp\": 6, \"contatinsvaluebeforeandafterupdatingvalue\": 1, \"containsvalue\": 4, \"microsoft\": 10, \"visualstudio\": 1, \"testtools\": 1, \"unittesting\": 1, \"dsa\": 1, \"trees\": 4, \"dsaunittests\": 1, \"testclass\": 1, \"trietests\": 1, \"addingandcheckingifcontained\": 1, \"addingandremovingsomewordsandcheckingifcontained\": 1, \"addingafterremovingeverything\": 1, \"addingafterclearingtrie\": 1, \"navigatioin\": 1, \"navbar\": 85, \"inverse\": 21, \"border\": 53, \"radius\": 36, \"background\": 258, \"rgba\": 44, \"1px\": 37, \"solid\": 12, \"255\": 50, \"height\": 34, \"100px\": 2, \"padding\": 18, \"25px\": 2, \"margin\": 22, \"focus\": 9, \"outline\": 1, \"media\": 75, \"width\": 49, \"767px\": 2, \"nav\": 34, \"li\": 215, \"open\": 9, \"ul\": 58, \"color\": 29, \"active\": 14, \"hover\": 21, \"fff\": 6, \"none\": 84, \"white\": 18, \"brand\": 6, \"font\": 23, \"family\": 5, \"sans\": 5, \"helvetica\": 1, \"arial\": 1, \"24px\": 1, \"15px\": 3, \"12px\": 3, \"img\": 46, \"8px\": 10, \"dropdown\": 23, \"menu\": 28, \"5px\": 11, \"13px\": 1, \"0px\": 61, \"webkit\": 27, \"moz\": 25, \"box\": 52, \"shadow\": 30, \"6px\": 5, \"175\": 2, \"7px\": 1, \"20px\": 8, \"btn\": 30, \"10px\": 7, \"collapse\": 23, \"align\": 7, \"auto\": 3, \"buttons\": 1, \"primary\": 12, \"success\": 1, \"info\": 13, \"warning\": 2, \"danger\": 1, \"2px\": 1, \"40px\": 54, \"bold\": 3, \"3px\": 22, \"lg\": 1, \"65px\": 2, \"14px\": 1, \"transparent\": 5, \"inset\": 18, \"333\": 4, \"ffefd7\": 1, \"image\": 18, \"linear\": 7, \"gradient\": 4, \"ff9b22\": 3, \"ff8c00\": 2, \"filter\": 2, \"progid\": 2, \"dximagetransform\": 2, \"startcolorstr\": 1, \"ffff9b22'\": 1, \"endcolorstr\": 1, \"ffff8c00'\": 1, \"gradienttype\": 1, \"enabled\": 1, \"repeat\": 21, \"jumbotron\": 9, \"inherit\": 4, \"f7f5f4\": 1, \"30px\": 6, \"container\": 33, \"h2\": 8, \"h3\": 44, \"h4\": 29, \"h5\": 13, \"h6\": 1, \"3em\": 1, \"images\": 48, \"rounded\": 3, \"bootstrap\": 19, \"v3\": 1, \"http\": 24, \"getbootstrap\": 1, \"2011\": 6, \"2014\": 23, \"twitter\": 17, \"inc\": 3, \"licensed\": 1, \"under\": 2, \"mit\": 2, \"twbs\": 1, \"blob\": 1, \"master\": 5, \"license\": 12, \"camera\": 595, \"wrap\": 45, \"ol\": 2, \"tbody\": 2, \"tfoot\": 2, \"thead\": 2, \"tr\": 2, \"td\": 2, \"thumbs\": 27, \"vertical\": 3, \"baseline\": 6, \"style\": 8, \"direction\": 2, \"ltr\": 1, \"display\": 24, \"relative\": 11, \"important\": 3, \"fakehover\": 1, \"60px\": 1, \"src\": 41, \"cameracont\": 1, \"cameracontents\": 1, \"cameraslide\": 1, \"absolute\": 28, \"cameracontent\": 1, \"target\": 98, \"overflow\": 11, \"overlayer\": 11, \"content\": 18, \"url\": 27, \"assets\": 64, \"gif\": 3, \"decoration\": 2, \"loader\": 3, \"ffffff\": 1, \"18px\": 5, \"36px\": 2, \"bar\": 24, \"cont\": 9, \"9px\": 1, \"120px\": 40, \"caption\": 8, \"div\": 423, \"camerarelative\": 1, \"imgfake\": 1, \"cursor\": 8, \"prevthumbs\": 35, \"4px\": 19, \"visibility\": 2, \"skins\": 6, \"png\": 28, \"160px\": 39, \"nextthumbs\": 35, \"190px\": 33, \"hidenav\": 1, \"pag\": 26, \"inline\": 4, \"16px\": 4, \"indent\": 2, \"9999px\": 2, \"commands\": 72, \"emboss\": 4, \"span\": 143, \"cameracurrent\": 2, \"thumb\": 5, \"arrow\": 2, \"41px\": 1, \"play\": 33, \"80px\": 45, \"stop\": 34, \"bottomright\": 1, \"bottomleft\": 1, \"both\": 8, \"showit\": 1, \"pattern\": 11, \"patterns\": 10, \"overlay1\": 1, \"overlay2\": 1, \"overlay3\": 1, \"overlay4\": 1, \"overlay5\": 1, \"overlay6\": 1, \"overlay7\": 1, \"overlay8\": 1, \"overlay9\": 1, \"overlay10\": 1, \"000\": 164, \"b7b7b7\": 3, \"434648\": 1, \"e6e6e6\": 2, \"d8d8d8\": 1, \"216\": 4, \"85\": 6, \"amber\": 8, \"skin\": 224, \"ash\": 7, \"200px\": 6, \"azure\": 7, \"240px\": 6, \"beige\": 7, \"black\": 14, \"blue\": 8, \"280px\": 6, \"brown\": 10, \"320px\": 6, \"burgundy\": 7, \"360px\": 6, \"charcoal\": 7, \"400px\": 6, \"chocolate\": 7, \"440px\": 6, \"coffee\": 8, \"480px\": 6, \"cyan\": 7, \"520px\": 6, \"fuchsia\": 7, \"560px\": 6, \"gold\": 9, \"600px\": 6, \"green\": 10, \"640px\": 6, \"grey\": 9, \"680px\": 6, \"indigo\": 7, \"720px\": 6, \"khaki\": 7, \"760px\": 6, \"lime\": 7, \"800px\": 6, \"magenta\": 7, \"840px\": 6, \"maroon\": 7, \"880px\": 6, \"orange\": 8, \"920px\": 6, \"olive\": 7, \"1080px\": 6, \"pink\": 17, \"960px\": 6, \"pistachio\": 7, \"1040px\": 6, \"red\": 16, \"1000px\": 6, \"tangerine\": 7, \"1120px\": 6, \"turquoise\": 7, \"1160px\": 6, \"violet\": 7, \"1200px\": 6, \"yellow\": 7, \"1240px\": 6, \"awesome\": 5, \"davegandy\": 1, \"fontawesome\": 3, \"io\": 3, \"sil\": 1, \"ofl\": 1, \"css\": 39, \"recommended\": 2, \"isotope\": 21, \"styles\": 6, \"filtering\": 1, \"events\": 1, \"css3\": 4, \"transitions\": 3, \"transition\": 30, \"duration\": 10, \"8s\": 5, \"ms\": 6, \"property\": 13, \"transform\": 4, \"opacity\": 5, \"disabling\": 1, \"0s\": 5, \"disable\": 1, \"containers\": 2, \"infinite\": 2, \"scrolling\": 2, \"window\": 1, \"html\": 63, \"body\": 15, \"666\": 1, \"110px\": 2, \"888\": 1, \"222\": 2, \"2em\": 4, \"topright\": 1, \"alkali\": 1, \"f00\": 1, \"hsl\": 10, \"alkaline\": 1, \"earth\": 3, \"f80\": 1, \"36\": 11, \"lanthanoid\": 1, \"ff0\": 1, \"72\": 9, \"actinoid\": 1, \"0f0\": 1, \"108\": 4, \"0f8\": 1, \"144\": 3, \"post\": 8, \"0ff\": 1, \"180\": 2, \"metalloid\": 1, \"08f\": 1, \"nonmetal\": 1, \"00f\": 1, \"252\": 1, \"halogen\": 1, \"f0f\": 1, \"288\": 2, \"noble\": 1, \"gas\": 9, \"f08\": 1, \"324\": 2, \"symbol\": 3, \"4em\": 1, \"8em\": 1, \"0em\": 3, \"large\": 7, \"5em\": 6, \"fake\": 1, \"6em\": 1, \"05em\": 1, \"9em\": 1, \"25em\": 1, \"hsla\": 1, \"variable\": 9, \"sizes\": 14, \"width2\": 3, \"230px\": 2, \"height2\": 3, \"350px\": 2, \"clickable\": 3, \"author\": 23, \"webthemez\": 19, \"creative\": 6, \"commons\": 4, \"attribution\": 4, \"unported\": 4, \"creativecommons\": 4, \"org\": 12, \"licenses\": 4, \"doctype\": 4, \"lang\": 7, \"en\": 11, \"meta\": 16, \"charset\": 4, \"utf\": 4, \"viewport\": 4, \"device\": 4, \"scale\": 4, \"real\": 31, \"estate\": 8, \"builders\": 6, \"responsive\": 17, \"website\": 9, \"templates\": 7, \"icon\": 20, \"rel\": 35, \"favicon\": 8, \"href\": 193, \"stylesheet\": 20, \"screen\": 10, \"fonts\": 4, \"googleapis\": 8, \"300\": 16, \"400\": 9, \"700\": 13, \"custom\": 14, \"template\": 12, \"theme\": 4, \"html5\": 14, \"shim\": 4, \"respond\": 8, \"js\": 38, \"ie8\": 4, \"support\": 4, \"queries\": 4, \"lt\": 4, \"script\": 38, \"html5shiv\": 4, \"header\": 14, \"button\": 20, \"screens\": 4, \"toggle\": 16, \"logo\": 4, \"alt\": 18, \"techro\": 4, \"pull\": 6, \"mainnav\": 4, \"home\": 9, \"services\": 14, \"price\": 17, \"projects\": 22, \"caret\": 4, \"sidebar\": 16, \"dummy\": 15, \"link1\": 4, \"link2\": 4, \"link3\": 4, \"contact\": 17, \"secondary\": 3, \"sm\": 22, \"h1\": 6, \"us\": 20, \"section\": 39, \"maincontent\": 2, \"company\": 4, \"jpg\": 20, \"lorem\": 30, \"ipsum\": 22, \"dolor\": 20, \"sit\": 20, \"amet\": 21, \"consectetur\": 36, \"adipisicing\": 16, \"elit\": 25, \"eveniet\": 17, \"consequuntur\": 21, \"eius\": 22, \"repellendus\": 22, \"eos\": 22, \"aliquid\": 22, \"molestiae\": 22, \"ea\": 22, \"laborum\": 21, \"ex\": 19, \"quibusdam\": 24, \"laudantium\": 14, \"voluptates\": 14, \"placeat\": 15, \"quam\": 18, \"aliquam\": 21, \"beatae\": 9, \"soluta\": 8, \"accusantium\": 9, \"iusto\": 10, \"nihil\": 9, \"nesciunt\": 10, \"unde\": 14, \"veniam\": 13, \"magnam\": 13, \"repudiandae\": 13, \"sapiente\": 13, \"nihiequuntur\": 1, \"solul\": 1, \"aside\": 4, \"panel\": 16, \"latest\": 2, \"news\": 10, \"unstyled\": 2, \"spaces\": 5, \"design\": 5, \"br\": 14, \"animi\": 2, \"javascript\": 5, \"clean\": 2, \"sed\": 3, \"mollitia\": 2, \"earum\": 2, \"debitis\": 2, \"est\": 4, \"itaque\": 2, \"esse\": 2, \"reiciendis\": 2, \"cupiditate\": 2, \"md\": 39, \"xs\": 18, \"center767\": 1, \"proin\": 2, \"neque\": 3, \"nisl\": 3, \"blandit\": 4, \"eu\": 4, \"aliquet\": 5, \"placerat\": 1, \"venenatis\": 2, \"mi\": 3, \"vestibulum\": 6, \"ac\": 8, \"mauris\": 12, \"justo\": 5, \"magna\": 1, \"ligula\": 2, \"lacus\": 2, \"nec\": 21, \"sodales\": 1, \"cursus\": 19, \"morbi\": 20, \"enim\": 6, \"tellus\": 2, \"quis\": 2, \"condimentum\": 2, \"risus\": 2, \"ut\": 2, \"arcu\": 2, \"eros\": 2, \"tristique\": 9, \"vel\": 6, \"turpis\": 3, \"duis\": 4, \"iaculis\": 6, \"dipisicing\": 1, \"achievements\": 2, \"strong\": 16, \"2015\": 68, \"consptates\": 1, \"2013\": 14, \"laboctetur\": 1, \"2012\": 11, \"laudauam\": 1, \"features\": 1, \"volutpat\": 2, \"ante\": 5, \"primis\": 2, \"faucibus\": 2, \"orci\": 8, \"luctus\": 20, \"et\": 27, \"ultrices\": 2, \"posuere\": 5, \"cubilia\": 2, \"constetuer\": 1, \"adipiscing\": 4, \"esent\": 1, \"molestie\": 1, \"eno\": 1, \"nummy\": 1, \"hendrerit\": 1, \"phasellus\": 1, \"port\": 1, \"usce\": 1, \"suscipit\": 1, \"cum\": 6, \"sociis\": 6, \"natoque\": 6, \"penatibu\": 1, \"magnis\": 23, \"dis\": 23, \"parturient\": 11, \"curae\": 1, \"ullamcorper\": 1, \"eleifen\": 1, \"vivamus\": 1, \"sagittis\": 1, \"curab\": 1, \"itur\": 1, \"ornare\": 1, \"metus\": 1, \"pharetra\": 1, \"sem\": 1, \"velondime\": 1, \"ntum\": 1, \"leo\": 1, \"imperdiet\": 1, \"accum\": 1, \"team\": 28, \"voluptate\": 7, \"minus\": 11, \"illo\": 7, \"tenetur\": 7, \"sint\": 7, \"ab\": 8, \"culpa\": 7, \"cumque\": 7, \"impedit\": 7, \"saepe\": 7, \"molestias\": 7, \"quia\": 7, \"photo\": 8, \"details\": 9, \"john\": 10, \"doe\": 4, \"designation\": 8, \"ceo\": 3, \"socials\": 8, \"fa\": 86, \"facebook\": 14, \"google\": 33, \"plus\": 11, \"dribbble\": 8, \"pdark\": 6, \"larry\": 3, \"director\": 2, \"ranith\": 2, \"kays\": 2, \"manager\": 3, \"joan\": 2, \"ray\": 5, \"btm\": 3, \"secpadding\": 5, \"clearfix\": 10, \"styled\": 6, \"snatoque\": 12, \"penatibus\": 22, \"partu\": 12, \"rient\": 12, \"montes\": 22, \"ascetur\": 22, \"ridiculus\": 22, \"mus\": 20, \"singapore\": 11, \"township\": 12, \"fusce\": 14, \"feugiat\": 14, \"malesuada\": 14, \"odio\": 32, \"nunc\": 18, \"gravida\": 18, \"mega\": 6, \"luxury\": 6, \"villas\": 6, \"rnt\": 6, \"commercial\": 6, \"shopping\": 7, \"mall\": 6, \"maecenas\": 6, \"svn\": 6, \"independent\": 6, \"duplex\": 6, \"houses\": 16, \"world\": 16, \"wide\": 7, \"park\": 10, \"north\": 6, \"arena\": 11, \"snt\": 6, \"clients\": 3, \"blockquote\": 9, \"erat\": 6, \"anim\": 3, \"pariatur\": 3, \"cliche\": 3, \"reprehenderit\": 3, \"eiusmod\": 3, \"life\": 4, \"accusamus\": 3, \"terry\": 3, \"richardson\": 3, \"ad\": 16, \"squid\": 3, \"small\": 11, \"someone\": 3, \"famous\": 3, \"cite\": 6, \"source\": 11, \"footer\": 9, \"footer2\": 3, \"simplenav\": 3, \"develop\": 3, \"panels\": 3, \"libs\": 6, \"document\": 3, \"load\": 3, \"faster\": 3, \"ajax\": 6, \"jquery\": 6, \"netdna\": 3, \"bootstrapcdn\": 3, \"muted\": 5, \"premium\": 4, \"quality\": 1, \"your\": 12, \"inting\": 1, \"typesetting\": 2, \"industry\": 1, \"been\": 2, \"ever\": 1, \"1500s\": 1, \"unknown\": 1, \"printer\": 2, \"took\": 1, \"galley\": 1, \"scrambled\": 1, \"make\": 15, \"specimen\": 1, \"book\": 1, \"light\": 2, \"mt\": 2, \"20\": 83, \"role\": 2, \"group\": 18, \"label\": 16, \"control\": 9, \"placeholder\": 9, \"email\": 4, \"phone\": 3, \"subject\": 2, \"textarea\": 2, \"submit\": 1, \"send\": 1, \"office\": 4, \"5th\": 3, \"street\": 6, \"carl\": 1, \"view\": 1, \"united\": 11, \"09\": 5, \"timings\": 1, \"monday\": 1, \"friday\": 1, \"00\": 13, \"am\": 1, \"pm\": 3, \"saturday\": 2, \"closed\": 3, \"sunday\": 2, \"ipsumn\": 1, \"qersl\": 2, \"ioinm\": 2, \"sersoe\": 2, \"urna\": 2, \"piesn\": 1, \"aecena\": 1, \"maps\": 3, \"api\": 30, \"exp\": 1, \"sensor\": 2, \"'stylesheet'\": 1, \"'camera\": 1, \"css'\": 3, \"'assets\": 1, \"'text\": 1, \"'all'\": 1, \"fluid\": 2, \"slides\": 6, \"slide1\": 2, \"slide2\": 2, \"slide3\": 2, \"city\": 12, \"autocomplete\": 1, \"adv\": 4, \"addon\": 2, \"checkbox\": 6, \"rent\": 2, \"sale\": 3, \"btnsearch\": 1, \"welcome\": 1, \"perspiciatis\": 1, \"omnis\": 1, \"iste\": 1, \"natus\": 1, \"voluptatem\": 1, \"musull\": 2, \"dui\": 4, \"ipsumulum\": 4, \"aenean\": 4, \"noummy\": 4, \"endrerit\": 4, \"penatibulorem\": 2, \"thumbnail\": 3, \"thumbnail4\": 3, \"news2\": 1, \"souvlaki\": 1, \"ignitus\": 1, \"carborundum\": 1, \"pluribus\": 1, \"unumfacto\": 1, \"lingo\": 2, \"igpay\": 2, \"atinlay\": 2, \"arquee\": 3, \"selectus\": 3, \"provisio\": 3, \"incongruous\": 3, \"feline\": 3, \"nolo\": 3, \"contendre\": 3, \"gratuitous\": 2, \"octopus\": 3, \"niacin\": 3, \"sodium\": 3, \"glutimate\": 2, \"quote\": 3, \"meon\": 3, \"more\": 7, \"news3\": 1, \"factorial\": 3, \"deposit\": 6, \"enumfacto\": 1, \"grat\": 1, \"uitous\": 1, \"estimate\": 2, \"interruptus\": 2, \"stad\": 2, \"news4\": 1, \"quid\": 1, \"proquo\": 1, \"gluti\": 1, \"mate\": 1, \"ium\": 1, \"sic\": 1, \"tempus\": 1, \"fugit\": 1, \"esperanto\": 1, \"packages\": 1, \"completed\": 1, \"import\": 26, \"java\": 21, \"util\": 18, \"scanner\": 38, \"climbstairs1\": 2, \"represents\": 14, \"ways\": 6, \"reach\": 21, \"stair\": 1, \"assume\": 3, \"0th\": 3, \"steps\": 9, \"handling\": 2, \"continue\": 4, \"step\": 26, \"2steps\": 1, \"sc\": 26, \"nextint\": 23, \"println\": 59, \"close\": 3, \"very\": 2, \"similar\": 4, \"but\": 5, \"instead\": 3, \"jumps\": 14, \"jump\": 2, \"nth\": 10, \"climbstairs2\": 1, \"getnoofways\": 4, \"way\": 2, \"climbstairs3\": 2, \"know\": 1, \"requried\": 1, \"math\": 21, \"coin\": 2, \"coins\": 17, \"tp\": 1, \"coinchange1\": 1, \"getmincoins\": 2, \"coin's\": 1, \"100000\": 3, \"cannnot\": 2, \"mark\": 9, \"coinchange2\": 2, \"getways\": 2, \"nums\": 32, \"choose\": 2, \"combinationsum1\": 1, \"boolean\": 25, \"select\": 2, \"consideing\": 1, \"exclusive\": 1, \"repetition\": 1, \"combinationsum2\": 1, \"professional\": 1, \"robber\": 1, \"rob\": 2, \"loot\": 20, \"steal\": 4, \"would\": 1, \"caught\": 1, \"house\": 16, \"money\": 1, \"houserobber1\": 4, \"getmaxloot\": 4, \"achieve\": 1, \"maximizing\": 1, \"loots\": 2, \"arranged\": 1, \"circular\": 1, \"means\": 2, \"1th\": 1, \"houserobber2\": 1, \"inorder\": 1, \"suppose\": 1, \"leave\": 3, \"house1\": 2, \"dp1\": 7, \"dp2\": 7, \"stealing\": 1, \"leaving\": 1, \"hosue\": 1, \"kadanesalgo\": 1, \"exception\": 22, \"global\": 22, \"boundedknapsack\": 1, \"achieved\": 2, \"sack\": 4, \"unboundedks\": 1, \"lcsexample1\": 1, \"findlengthoflcs\": 2, \"str1\": 10, \"str2\": 9, \"q\": 54, \"tableforlcs\": 10, \"charat\": 6, \"longestcommonsubsequence\": 4, \"0'\": 1, \"sequence\": 2, \"nextline\": 2, \"printlis\": 2, \"paths\": 7, \"maxlength\": 4, \"subsequences\": 2, \"countsubsequence\": 2, \"less\": 7, \"binarysearchr\": 1, \"vertices\": 43, \"adj\": 11, \"adjacency\": 3, \"constructor\": 4, \"addedge\": 40, \"illegalargumentexception\": 5, \"bfs\": 8, \"visited\": 18, \"dequeue\": 16, \"vertex\": 149, \"poll\": 2, \"dequeued\": 1, \"iterator\": 1, \"listiterator\": 1, \"hasnext\": 1, \"g\": 19, \"edges\": 53, \"startvertex\": 5, \"catch\": 2, \"inputmismatchexception\": 1, \"please\": 3, \"getmessage\": 1, \"linearsearch\": 6, \"perform\": 2, \"kichu\": 1, \"bubble\": 5, \"tostring\": 8, \"swaping\": 1, \"largest\": 1, \"isasc\": 4, \"greater\": 5, \"entire\": 2, \"counting\": 1, \"descending\": 1, \"countingsort\": 3, \"stream\": 1, \"orelse\": 1, \"over\": 7, \"increment\": 2, \"element's\": 2, \"reflect\": 1, \"backwards\": 1, \"sortedarray\": 2, \"before\": 1, \"sorting\": 2, \"middle\": 16, \"istlist\": 3, \"iindlist\": 6, \"selects\": 1, \"pi\": 10, \"partitioned\": 1, \"intarray\": 19, \"routine\": 2, \"partitions\": 1, \"quick\": 5, \"around\": 1, \"original\": 4, \"recursion\": 2, \"recursivefactorial\": 3, \"execution\": 1, \"recursivesolution\": 2, \"startv\": 4, \"endv\": 4, \"inputweight\": 4, \"getstart\": 4, \"getend\": 12, \"getweight\": 5, \"inputdata\": 4, \"endvertex\": 4, \"removeedge\": 9, \"removeif\": 3, \"getdata\": 20, \"getedges\": 7, \"showweight\": 2, \"implementation\": 17, \"isweighted\": 9, \"isdirected\": 10, \"inputisweighted\": 4, \"inputisdirected\": 4, \"addvertex\": 31, \"newvertex\": 6, \"vertex1\": 6, \"vertex2\": 6, \"removevertex\": 2, \"getvertices\": 5, \"getvertexbyvalue\": 2, \"trainnetwork\": 6, \"atlantastation\": 3, \"atlanta\": 2, \"newyorkstation\": 3, \"york\": 28, \"800\": 13, \"dijkstra\": 5, \"love\": 2, \"teach\": 1, \"weird\": 1, \"well\": 3, \"sure\": 4, \"doesn't\": 4, \"queueobject\": 8, \"comparable\": 1, \"compareto\": 2, \"dictionary\": 8, \"startingvertex\": 13, \"distances\": 11, \"hashtable\": 14, \"priorityqueue\": 3, \"alternate\": 3, \"neighborvalue\": 5, \"shortestpathbetween\": 2, \"targetvertex\": 4, \"dijkstradicts\": 3, \"distance\": 3, \"shortest\": 3, \"pathvertex\": 2, \"dijkstraresultprinter\": 2, \"enumeration\": 2, \"hasmoreelements\": 2, \"nextkey\": 6, \"nextelement\": 2, \"nprevious\": 1, \"nextvertex\": 2, \"testgraph\": 73, \"f\": 13, \"file\": 5, \"folder\": 3, \"graphtraverser\": 7, \"addtotail\": 1, \"peek\": 9, \"removehead\": 1, \"lineardatastructures\": 1, \"traverser\": 1, \"depthfirsttraversal\": 5, \"visitedvertices\": 22, \"neighbor\": 15, \"breadthfirsttraversal\": 4, \"visitqueue\": 5, \"startnode\": 6, \"v0\": 2, \"v11\": 8, \"v12\": 6, \"v21\": 6, \"v111\": 4, \"v112\": 4, \"v121\": 4, \"v211\": 6, \"cycle\": 4, \"getstartingvertex\": 4, \"traversing\": 3, \"down\": 10, \"layer\": 1, \"traverse\": 4, \"examplelinear\": 2, \"log\": 43, \"examplequadratic\": 2, \"examplecubic\": 2, \"examplelogarithmic\": 2, \"coefficient\": 1, \"rule\": 2, \"big\": 2, \"os\": 2, \"polynomial\": 1, \"exercises\": 1, \"somefunction\": 6, \"1000\": 2, \"'answer\": 6, \"hi\": 19, \"2n\": 1, \"lowindex\": 4, \"highindex\": 4, \"midindex\": 6, \"floor\": 9, \"startindex\": 4, \"endindex\": 4, \"middleindex\": 6, \"121\": 3, \"71\": 6, \"102\": 3, \"sqrtintnaive\": 2, \"sqrtint\": 2, \"let\": 4, \"parseint\": 2, \"upper\": 10, \"lower\": 5, \"sqrtdouble\": 2, \"threshold\": 2, \"0234375\": 1, \"findtwosum\": 3, \"arraylength\": 7, \"findonlyonce\": 6, \"findonlyoncehelper\": 2, \"rotated\": 2, \"findminrotated\": 4, \"condition\": 1, \"handle\": 1, \"cases\": 1, \"decide\": 1, \"half\": 3, \"findminrotatedhelper\": 2, \"index1\": 3, \"index2\": 3, \"len\": 29, \"anything\": 2, \"isn't\": 1, \"23\": 24, \"currently\": 2, \"being\": 2, \"compared\": 1, \"unsorted\": 4, \"may\": 1, \"later\": 2, \"whenever\": 1, \"creates\": 2, \"quicksorthelper\": 4, \"quickselectinplace\": 6, \"medianquickselect\": 1, \"fifth\": 2, \"tenth\": 1, \"lefta\": 5, \"righta\": 5, \"leftindex\": 5, \"rightindex\": 5, \"leftremains\": 2, \"slice\": 6, \"rightremains\": 2, \"remaining\": 2, \"resultant\": 1, \"concat\": 2, \"midpoint\": 3, \"leftarray\": 2, \"rightarray\": 2, \"countsort\": 2, \"countarr\": 3, \"comparatornumber\": 4, \"mythical\": 6, \"'dragon'\": 2, \"'slayer'\": 2, \"'magic'\": 2, \"'wizard\": 2, \"oz'\": 2, \"'ned\": 2, \"stark'\": 1, \"sortcomparator\": 6, \"tark'\": 1, \"prop1\": 6, \"''\": 30, \"prop2\": 6, \"prop3\": 2, \"wordcount\": 2, \"sentence\": 2, \"period\": 1, \"nothing\": 1, \"wordsarray\": 3, \"split\": 9, \"occurencelist\": 6, \"answerlist\": 3, \"wordslength\": 2, \"currentword\": 4, \"occurrence\": 1, \"occurrences\": 1, \"arraytemp\": 5, \"prop\": 3, \"sortcomp\": 2, \"arrlength\": 2, \"pairs\": 1, \"practice\": 3, \"perfect\": 2, \"localstorage\": 2, \"setitem\": 1, \"testkey\": 2, \"testvalue\": 2, \"refreshes\": 1, \"page\": 1, \"getitem\": 1, \"prints\": 4, \"probing\": 7, \"initarray\": 3, \"limit\": 7, \"prototype\": 48, \"'hash\": 3, \"full'\": 3, \"hashedindex\": 37, \"isinteger\": 2, \"'must\": 2, \"int'\": 2, \"exampletable\": 9, \"13\": 41, \"sunny\": 1, \"46\": 2, \"weather\": 2, \"59\": 2, \"wow\": 3, \"fourty\": 1, \"happy\": 4, \"98\": 7, \"sad\": 1, \"quadratic\": 3, \"squareindex\": 6, \"pow\": 5, \"star\": 1, \"secondhash\": 2, \"hashedkey\": 2, \"getbuffer\": 6, \"stack1\": 14, \"stackaccessnthtopnode\": 2, \"'error'\": 2, \"bufferarray\": 8, \"bufferstack\": 6, \"stack2\": 5, \"stacksearch\": 2, \"stack3\": 5, \"queue1\": 11, \"queueaccessnthtopnode\": 1, \"bufferqueue\": 9, \"queuesearch\": 1, \"twostackqueue\": 4, \"inbox\": 10, \"outbox\": 4, \"queuestack\": 4, \"popped\": 2, \"cashier\": 11, \"customers\": 3, \"addorder\": 4, \"deliverorder\": 4, \"finishedcustomer\": 3, \"ready\": 5, \"customer1\": 2, \"'jim'\": 1, \"fries\": 2, \"customer2\": 2, \"'sammie'\": 1, \"burger\": 5, \"customer3\": 2, \"'peter'\": 1, \"drink\": 2, \"jim\": 2, \"sammie\": 1, \"peter\": 4, \"isparenthesisvalid\": 4, \"validationstring\": 3, \"currentchar\": 4, \"sortablestack\": 3, \"mainstack\": 5, \"sortedstack\": 6, \"random\": 3, \"ints\": 1, \"sortstackdescending\": 2, \"ss\": 5, \"singlylinkedlistnode\": 3, \"sll1\": 21, \"currenthead\": 19, \"skipping\": 1, \"wasn't\": 1, \"deleteathead\": 3, \"toreturn\": 9, \"doublylinkedlistnode\": 5, \"insertathead\": 21, \"dll1\": 29, \"ddl1's\": 19, \"insertattail\": 5, \"deleteattail\": 2, \"findstartinghead\": 3, \"findstartingtail\": 3, \"currenttail\": 5, \"reversesinglelinkedlist\": 1, \"sll\": 2, \"delete\": 12, \"duplicates\": 3, \"deleteduplicateinunsortedsll\": 1, \"track\": 8, \"deleteduplicateinunsortedsllbest\": 1, \"lfunode\": 5, \"freqcount\": 11, \"lfudoublylinkedlist\": 9, \"'buffer\": 2, \"head'\": 1, \"tail'\": 1, \"lfucache\": 4, \"freq\": 28, \"minfreq\": 7, \"removeattail\": 2, \"oldtail\": 4, \"removenode\": 10, \"undefined\": 7, \"deleting\": 1, \"oldfreqcount\": 8, \"mylfu\": 21, \"dllnode\": 4, \"lrucache\": 9, \"addnode\": 3, \"realtail\": 3, \"evict\": 1, \"realhead\": 3, \"mylru\": 11, \"binarytree\": 2, \"traverseinorder\": 1, \"php\": 26, \"encrypt\": 7, \"atbash\": 7, \"cipher\": 20, \"simple\": 5, \"substitution\": 3, \"letter\": 3, \"plaintext\": 20, \"replaced\": 1, \"corresponding\": 1, \"alphabet\": 22, \"characters\": 5, \"encrypted\": 12, \"strtoupper\": 7, \"strlen\": 13, \"ctype\": 12, \"alpha\": 5, \"offset\": 2, \"ord\": 19, \"'z'\": 1, \"encryptedchar\": 5, \"chr\": 5, \"'a'\": 17, \"remain\": 1, \"unchanged\": 3, \"decrypt\": 6, \"decryption\": 5, \"encryption\": 5, \"ciphertext\": 16, \"decrypted\": 10, \"caesar\": 2, \"shifts\": 2, \"applied\": 2, \"encryptedtext\": 8, \"going\": 4, \"character\": 24, \"placevalue\": 12, \"26\": 17, \"applying\": 2, \"formula\": 5, \"newchar\": 4, \"appending\": 4, \"decryptedtext\": 8, \"remainder\": 4, \"mono\": 2, \"alphabetic\": 4, \"www\": 5, \"101computing\": 1, \"net\": 1, \"monoalphabeticcipher\": 3, \"matches\": 1, \"preg\": 1, \"strripos\": 1, \"maencrypt\": 1, \"madecrypt\": 1, \"encode\": 5, \"morse\": 10, \"encoded\": 5, \"uppercase\": 2, \"containing\": 2, \"translations\": 2, \"encodedtext\": 4, \"checks\": 5, \"appends\": 2, \"correct\": 3, \"substr\": 4, \"removes\": 6, \"trailing\": 2, \"decode\": 4, \"decodedtext\": 3, \"decoded\": 2, \"explode\": 1, \"prevent\": 1, \"extra\": 1, \"breaking\": 3, \"rail\": 5, \"fence\": 4, \"wikipedia\": 8, \"wiki\": 7, \"plainmessage\": 4, \"rails\": 13, \"rows\": 3, \"railencode\": 1, \"ciphermessage\": 10, \"plain\": 3, \"isset\": 4, \"combine\": 8, \"placeholders\": 1, \"implode\": 7, \"encoding\": 1, \"raildecode\": 1, \"textlength\": 4, \"minlength\": 3, \"balance\": 3, \"lengths\": 7, \"totallengths\": 3, \"rowindex\": 13, \"convert\": 4, \"charindex\": 6, \"encrypts\": 1, \"vigen\\u00e8re\": 4, \"vigen\": 1, \"c3\": 1, \"a8re\": 1, \"vigenere\": 2, \"consistency\": 1, \"keylength\": 4, \"apply\": 2, \"decrypts\": 1, \"decryptedchar\": 2, \"xor\": 1, \"additive\": 1, \"bitwise\": 1, \"xored\": 1, \"xoring\": 1, \"repeated\": 1, \"until\": 11, \"xorcipher\": 1, \"idx\": 5, \"join\": 3, \"converts\": 7, \"submitted\": 7, \"working\": 3, \"binarynumber\": 8, \"binarytodecimal\": 1, \"numeric\": 7, \"'please\": 8, \"converting\": 7, \"decimalnumber\": 27, \"binarydigits\": 2, \"digit\": 11, \"decimaltobinary\": 1, \"octal\": 7, \"160\": 5, \"171\": 1, \"octalnumber\": 9, \"hextodecimal\": 1, \"hexnumber\": 5, \"digits\": 5, \"hex\": 1, \"xdigit\": 1, \"hexadecimal\": 4, \"mapping\": 5, \"decimaldigitmappings\": 2, \"'b'\": 2, \"'c'\": 2, \"'d'\": 2, \"'e'\": 2, \"'f'\": 2, \"hexdigits\": 12, \"power\": 7, \"hexdigit\": 3, \"decimaltohex\": 1, \"hexdigitmappings\": 2, \"ltrim\": 1, \"'0'\": 1, \"connecting\": 1, \"leading\": 1, \"zeroes\": 1, \"octaltodecimal\": 1, \"octaldigits\": 2, \"decimaltooctal\": 1, \"speed\": 7, \"another\": 3, \"conversion\": 3, \"taken\": 1, \"asknumbers\": 1, \"speedconversion\": 1, \"aspx\": 1, \"available\": 1, \"units\": 2, \"mph\": 1, \"miles\": 1, \"per\": 150, \"hour\": 2, \"km\": 39, \"kilometers\": 2, \"meters\": 1, \"ft\": 1, \"feet\": 1, \"kn\": 1, \"knot\": 2, \"nautical\": 1, \"mile\": 1, \"1852\": 1, \"made\": 1, \"unitfrom\": 4, \"unitto\": 4, \"convertspeed\": 1, \"speedunitsfrom\": 3, \"'mph'\": 2, \"609344\": 1, \"'km\": 2, \"h'\": 2, \"'m\": 2, \"s'\": 4, \"'ft\": 2, \"097\": 1, \"'kn'\": 2, \"852\": 1, \"speedunitsto\": 2, \"6213712\": 1, \"277778\": 1, \"911344\": 1, \"539957\": 1, \"availableunits\": 4, \"navailable\": 1, \"round\": 5, \"require\": 1, \"dir\": 1, \"php'\": 1, \"construct\": 4, \"destructor\": 1, \"destruct\": 2, \"tail's\": 3, \"node's\": 33, \"head's\": 6, \"we've\": 2, \"reached\": 2, \"we're\": 3, \"looking\": 3, \"deleteat\": 1, \"printlist\": 1, \"echo\": 8, \"printlistreverse\": 1, \"beginning\": 3, \"comma\": 1, \"singly\": 1, \"instanceof\": 2, \"unset\": 1, \"fromarray\": 1, \"bellman\\u0096ford\": 1, \"computes\": 1, \"weighted\": 4, \"digraph\": 2, \"bellman\": 1, \"e2\": 1, \"93ford\": 1, \"micha\": 1, \"arnecki\": 1, \"rzarno\": 1, \"verticies\": 2, \"bellmanford\": 1, \"verticesnames\": 3, \"verbose\": 4, \"vertice\": 10, \"minweight\": 1, \"satisfies\": 2, \"references\": 2, \"cp\": 1, \"python\": 10, \"aryansh\": 1, \"bhargavan\": 1, \"aryanshb\": 1, \"adjlist\": 6, \"grapth\": 2, \"graphs\": 3, \"geeksforgeeks\": 1, \"dfs\": 2, \"andre\": 2, \"alves\": 1, \"andremralves\": 1, \"calculates\": 2, \"different\": 2, \"provided\": 3, \"sized\": 2, \"absolutemax\": 5, \"value'\": 2, \"loopindex\": 10, \"absolutemin\": 5, \"armstrong\": 1, \"153\": 1, \"isnumberarmstrong\": 1, \"'intval'\": 2, \"sumofcubes\": 3, \"num\": 4, \"quickly\": 1, \"basex\": 3, \"representation\": 1, \"sevada797\": 2, \"isnumberpalindromic\": 1, \"arrrev\": 2, \"inputrev\": 2, \"python3\": 1, \"arithmetic\": 1, \"def\": 110, \"carry\": 7, \"shifted\": 1, \"adding\": 2, \"gives\": 1, \"declear\": 1, \"anagrams\": 1, \"anagram\": 3, \"'geek'\": 2, \"'eegk'\": 1, \"'peek'\": 1, \"18\": 13, \"amitrajit\": 1, \"bose\": 1, \"package\": 5, \"amitrajitbose\": 2, \"'''\": 6, \"lru\": 3, \"cache\": 5, \"replacement\": 1, \"policies\": 1, \"recently\": 3, \"extensively\": 1, \"ds\": 1, \"scratch\": 1, \"external\": 1, \"library\": 1, \"collection\": 2, \"\\r\": 103, \"list\\r\": 5, \"self\": 330, \"hmap\": 8, \"cache\\r\": 3, \"movetohead\": 3, \"removelruentry\": 2, \"evicts\": 1, \"poptail\": 2, \"del\": 5, \"adds\": 2, \"oldprev\": 3, \"oldnext\": 3, \"puts\": 1, \"pointed\": 1, \"rem\": 4, \"order\\r\": 1, \"instantiated\": 1, \"anushkrishnav\": 1, \"built\": 1, \"networkx\": 5, \"standard\": 2, \"dags\": 1, \"tuples\": 2, \"nx\": 5, \"matplotlib\": 2, \"pyplot\": 1, \"plt\": 13, \"dag\": 6, \"addedges\": 1, \"and\\r\": 3, \"acyclic\": 5, \"insertion\": 3, \"raise\": 7, \"unable\": 1, \"addsetofedges\": 2, \"listt\": 3, \"furthur\": 1, \"refer\": 1, \"visualise\": 5, \"accourdingly\\r\": 1, \"eg\\r\": 1, \"tight\": 1, \"layout\": 1, \"draw\": 1, \"arrows\": 1, \"savefig\": 1, \"clf\": 1, \"generated\": 1, \"datastructure\": 1, \"unweighted\": 1, \"single\\r\": 1, \"weightedgraph\": 3, \"graph\\r\": 1, \"equivalent\": 1, \"unweightedgraph\": 2, \"dest\": 14, \"demonstrate\": 1, \"functionality\": 2, \"ugraph\": 7, \"wgraph\": 7, \"heap\\r\": 3, \"provides\": 2, \"following\\r\": 1, \"findmin\": 6, \"runtimes\": 1, \"that\\r\": 1, \"runs\": 2, \"done\": 22, \"treat\": 1, \"the\\r\": 2, \"right\\r\": 2, \"indicies\": 2, \"2i\": 4, \"respectively\": 1, \"operates\": 1, \"assumption\": 1, \"invariant\": 6, \"due\": 1, \"transittivity\": 1, \"lets\": 1, \"dont\": 1, \"transitive\": 2, \"ing\": 1, \"record\": 1, \"bubbling\": 3, \"operation\": 1, \"opposite\": 1, \"bubbles\": 2, \"retain\": 4, \"parent\\r\": 1, \"kept\": 1, \"extreme\\r\": 2, \"extreme\": 8, \"index\\r\": 1, \"1\\r\": 2, \"2\\r\": 1, \"left\\r\": 1, \"break\\r\": 1, \"heapify\": 1, \"re\": 1, \"arrange\": 1, \"enforce\": 1, \"indexerror\": 3, \"heappop\": 2, \"rearranges\": 2, \"to\\r\": 1, \"heappush\": 2, \"heappushpop\": 2, \"successively\": 1, \"simplify\": 1, \"process\": 2, \"only\\r\": 1, \"wrapper\": 1, \"individual\": 1, \"methods\": 2, \"might\": 1, \"realise\": 1, \"you\\r\": 1, \"pushpop\": 1, \"tstack\": 1, \"operations'\": 1, \"'1\": 1, \"push'\": 1, \"'2\": 1, \"pop'\": 1, \"'3\": 1, \"peek'\": 1, \"'4\": 1, \"stack'\": 1, \"'5\": 1, \"exit'\": 1, \"'enter\": 1, \"choice\": 6, \"'wrong\": 1, \"only'\": 1, \"'bye'\": 1, \"hascycle\": 2, \"starts\": 1, \"fastptr\": 10, \"slowptr\": 8, \"nextnode\": 16, \"insertend\": 6, \"02\": 4, \"krishnan\": 2, \"navadia\": 1, \"tech\": 2, \"curr\": 81, \"prepend\": 1, \"iterative\": 3, \"key1\": 3, \"key2\": 3, \"nxt\": 4, \"helper\": 3, \"llist\": 34, \"dup\": 3, \"dict\": 8, \"cur\": 7, \"occurances\": 1, \"rotate\": 1, \"codeperfectplus\": 2, \"iter\": 1, \"valueerror\": 3, \"linkedlis\": 1, \"python\\r\": 3, \"supporting\": 1, 